# Parameter Type Id Rotate Copy Property

Source: https://www.revitapidocs.com/2026/21f78acb-5c6b-914f-fad1-5ddacd166e0f.htm

---

| Parameter Type Id Rotate Copy Property |
| --- |

"Copy"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RotateCopy { get; }
```

```
Public Shared ReadOnly Property RotateCopy As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RotateCopy {
	ForgeTypeId^ get ();
}
```

```
static member RotateCopy : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace